
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Тест!");
		Сообщить("Ура!!!");
		Сообщить("Ура2");
//{{MRG[ <!-> ]
		Сообщить("Ура3");
//}}MRG[ <!-> ]
//{{MRG[ <-!> ]
		Сообщить("Ура2_ответвление");
//}}MRG[ <-!> ]
//{{MRG[ <!-> ]
		Сообщить("Ура4");
//}}MRG[ <!-> ]
//{{MRG[ <-!> ]
		Сообщить("Ура2_ответвление 2");
//}}MRG[ <-!> ]
	КонецЕсли;
	Сер();
КонецПроцедуры

Процедура Сер()
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Товары.Ссылка) КАК Наим
	|ИЗ
	|	Справочник.Товары КАК Товары";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Наим);		
	КонецЦикла;
КонецПроцедуры