
#Область ОбрабочикиСобытий
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Если Объект.Ссылка.Пустая() Тогда
			ПоказатьПредупреждение(, "Тест!");
			Сообщить("Ура!!!");
			Сообщить("Ура2");
			Сообщить("Ура2_ответвление");
			Сообщить("Ура2_ответвление 2");
			Сообщить("Ура2_ответвление 3");
		КонецЕсли;
		
		парам1 = 0;
		Сер(парам1);
	КонецПроцедуры
#КонецОбласти

Процедура Сер(парам1)
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Товары.Ссылка) КАК Наим
	|ИЗ
	|	Справочник.Товары КАК Товары";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Наим);		
	КонецЦикла;
КонецПроцедуры